sabonis/ubuntu/ror/ror/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_param)
    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hi"], ["text", "This is my fucking first article for rails.\r\n"], ["created_at", "2015-03-07 16:03:56.718443"], ["updated_at", "2015-03-07 16:03:56.718443"]]

  def update
    @article = Article.find(params[:id])
    if @article.update(article_param)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "dsfdsd333"], ["updated_at", "2015-03-18 15:56:19.814968"], ["id", 14]]